{

  "name": "Conner Hufnagel",
  "title": "Software Engineer",
  "summary": "I am a passionate Software Engineer based in Los Angeles, CA. I have experience working in cross functional teams building backend and frontend applications. I am proficient in Python, C#, React.js, and Typescript.",

  "contact": {
    "email": "conner.huf@gmail.com",
    "phone": "405-397-0507",
    "location": "Los Angeles, CA"
  },

  "skills": {
    "languages": ["Typescript, Javascript, Python, C#, SQL, C++, HTML5, CSS, Swift, Java"],
    "Technologies": ["React.js, Flask, FastAPI, Django, ASP.NET, .NET Core, Azure, AWS, GraphQL, REST, Docker, JSON, Git, Jest, Express.js"],
    "Databases": ["MySQL, Postgres, MongoDB, Firebase, SQLite, Supabase, DynamoDB"]
  },

  "professional_experience": [
    {
      "company": "Autaly",
      "role": "Software Engineer",
      "duration": "June 2024 - Present",
      "responsibilities": [
        "Implemented GraphQL API with FastAPI in Python, optimizing communication between the frontend and backend, and ensuring efficient data handling",
        "Built modular and reusable UI components in TypeScript, enhancing the scalability and maintainability of the codebase",
        "Ensured code quality and best practices by writing unit tests and utilizing type safety features in TypeScript, resulting in fewer runtime errors and easier debugging"
      ]
    },
    {
      "company": "Army National Guard",
      "role": "Computer Systems Operator",
      "duration": "July 2016 - July 2022",
      "responsibilities": [
        "Diagnosed and resolved complex technical issues with high-specialized defense computer hardware and software systems supporting 500 personnel across multiple locations",
        "Managed data input and output processes, implementing rigorous data verification and backup procedures to ensure 100% data accuracy and integrity during over 200 individual operations",
        "Conducted rigorous pre-project system checks and detailed post-project debriefs, ensuring accurate data collection, analysis, reporting, and informed decision-making for project planning and evaluation"
      ]
    },
    {
      "company": "Sunbeam Family Services",
      "role": "Health Data Analyst",
      "duration": "August 2019 - July 2022",
      "responsibilities": [
        "Maintained and managed a comprehensive database, meticulously tracking health data and compliance records for every student enrolled, ensuring accurate documentation and timely updates for over 5 years post-care in adherence to DHS regulations",
        "Implemented new health compliance policies across 17 school sites to align with federal health standards, resulting in achieving a 92% compliance rate for a student population exceeding 1500 individuals. A 27% increase from initial compliance ratings",
        "Led a team of 4 through a comprehensive federal compliance audit, overseeing health screenings for 500 actively enrolled children within a stringent 90-day timeframe to ensure continued funding and program viability"
      ]
    }
  ],

  "projects": [
    {
      "name": "Autaly",
      "url": "https://app.autaly.co",
      "description": "A platform for simplifying logistics billing and invoicing processes for small to medium-sized 3PL businesses.",
      "technologies": ["React.js", "FastAPI", "Next.js", "MongoDB", "GraphQL", "HTML", "CSS", "Tamagui"],
      "responsibilities": [
        "Implemented a backend API and database to store information on client’s invoices, orders, and payment information.",
        "Created a responsive front end UI for filtering invoices and automating invoicing based on user defined charge rules, which led to an increase in client subscription to the service",
        "Optimized API call and state management to ensure a quality user experience and minimize loading times"
      ]
    },
    {
      "name": "Noodle",
      "url": "https://conner-huf.github.io/noodle/",
      "description": "A platform for finding local live music events and venues in your area. Implemented using the Ticketmaster API and the Spotify API to provide users with a seamless experience.",
      "technologies": ["Python, Flask, Javascript, React.js, TicketmasterAPI, Leaflet.js, SpotifyAPI"],
      "responsibilities": [
        "Implemented a Python back-end rest API and Reactjs front-end UI using Leafletjs to create a live-music ticketing application following UI/UX best practices",
        "Developed backend Rest APIs for a user to find concerts in their city and purchase tickets through Ticketmaster",
        "Tested component performance using Jest J unit testing and QA practices to achieve 86% test cases over the program"
      ]
    },
    {
      "name": "ConnerAPI",
      "url": "https://app-connerapi-dev.azurewebsites.net/resume",
      "description": "This is a Rest API for serving the details of my resume in JSON format.",
      "technologies": ["C#, .NET Core, Azure, REST, JSON"],
      "responsibilities": [
        "Utilized Clean architecture design patterns to create a maintainable, scalable, and modular backend web server system with multiple endpoints and HTTP methods supported",
        "Implemented connection with a mySQL database for increased data security and for maintaining an external repository of data",
        "Deployed the product using Microsoft Azure and GitHub actions to provide CI/CD to keep up with additions and updates to the web server"
      ]
    }
  ],

  "education": {
    "degree": {
      "school": "Southern New Hampshire University",
      "degree": "Bachelor of Science in Computer Science",
      "year": "2023"
    },
    "certifications": [
      {
        "name": "AZ-900: Microsoft Azure Fundamentals",
        "year": "2024"
      },
      {
        "name": "AWS Certified Solutions Architect - Associate",
        "year": "2024"
      },
      {
        "name": "Front-end Software Development - Meta",
        "year": "2023"
      },
      {
        "name": "Full-Stack Software Development - IBM",
        "year": "2024"
      }
    ]
  }
    
}